INSERT OR IGNORE INTO Subjects VALUES
('05506232','คณิตศาสตร์สำหรับวิทยาการคอมพิวเตอร์','Mathematics for Computer Science',3,'อ.กนกณัฏฐช์',NULL,'LETTER',1),
('05506231','สถิติและความน่าจะเป็น','Statistics and Probability',3,'อ.จีรพร',NULL,'LETTER',1),
('05506003','การเขียนโปรแกรมขั้นพื้นฐาน','Programming Fundamentals',3,'อ.สันธนะ',NULL,'LETTER',1),
('05506005','วิทยาการคอมพิวเตอร์','Computer Science',3,'อ.สันธนะ',NULL,'LETTER',1),
('90644007','ภาษาอังกฤษพื้นฐาน 1','Foundation English 1',3,'อ.อังกฤษ1',NULL,'SU',1),
('90641001','โรงเรียนสร้างเสน่ห์','Charm School',3,'อ.ชาร์มสคูล',NULL,'SU',1);

INSERT OR IGNORE INTO SubjectStructure VALUES
('CSY1CUR','วท.บ. วิทยาการคอมพิวเตอร์ ปี 1','ภาควิชาวิทยาการคอมพิวเตอร์','05506232',1),
('CSY1CUR','วท.บ. วิทยาการคอมพิวเตอร์ ปี 1','ภาควิชาวิทยาการคอมพิวเตอร์','05506231',1),
('CSY1CUR','วท.บ. วิทยาการคอมพิวเตอร์ ปี 1','ภาควิชาวิทยาการคอมพิวเตอร์','05506003',1),
('CSY1CUR','วท.บ. วิทยาการคอมพิวเตอร์ ปี 1','ภาควิชาวิทยาการคอมพิวเตอร์','05506005',1),
('CSY1CUR','วท.บ. วิทยาการคอมพิวเตอร์ ปี 1','ภาควิชาวิทยาการคอมพิวเตอร์','90644007',1),
('CSY1CUR','วท.บ. วิทยาการคอมพิวเตอร์ ปี 1','ภาควิชาวิทยาการคอมพิวเตอร์','90641001',1);