INSERT OR IGNORE INTO Subjects VALUES
('05506233','แคลคูลัสสำหรับวิทยาการคอมพิวเตอร์','Calculus for Computer Science',3,'อ.ธีรวัตร์','05506232','LETTER',2),
('05506001','คณิตศาสตร์ดิสครีต','Discrete Mathematics',3,'อ.วิสันต์','05506232','LETTER',2),
('05506004','การเขียนโปรแกรมเชิงออบเจกต์','Object-Oriented Programming',3,'อ.สันธนะ','05506003','LETTER',2),
('05506008','โครงสร้างและสถาปัตยกรรมคอมพิวเตอร์','Computer Organization and Architecture',3,'อ.จีรพร',NULL,'LETTER',2),
('90641002','ความฉลาดทางดิจิทัล','Digital Intelligence Quotient',3,'อ.ดิจิทัล',NULL,'SU',2),
('90644008','ภาษาอังกฤษพื้นฐาน 2','Foundation English 2',3,'อ.อังกฤษ2','90644007','SU',2);

INSERT OR IGNORE INTO SubjectStructure VALUES
('CSY1CUR','วท.บ. วิทยาการคอมพิวเตอร์ ปี 1','ภาควิชาวิทยาการคอมพิวเตอร์','05506233',2),
('CSY1CUR','วท.บ. วิทยาการคอมพิวเตอร์ ปี 1','ภาควิชาวิทยาการคอมพิวเตอร์','05506001',2),
('CSY1CUR','วท.บ. วิทยาการคอมพิวเตอร์ ปี 1','ภาควิชาวิทยาการคอมพิวเตอร์','05506004',2),
('CSY1CUR','วท.บ. วิทยาการคอมพิวเตอร์ ปี 1','ภาควิชาวิทยาการคอมพิวเตอร์','05506008',2),
('CSY1CUR','วท.บ. วิทยาการคอมพิวเตอร์ ปี 1','ภาควิชาวิทยาการคอมพิวเตอร์','90641002',2),
('CSY1CUR','วท.บ. วิทยาการคอมพิวเตอร์ ปี 1','ภาควิชาวิทยาการคอมพิวเตอร์','90644008',2);